"use script"

// Задача №1
// Яка назва змінної вірна
// 1) let user-name
// 2) let UserName
// 3) let userName

// Вірний варіант 3, в lowerCamelCase!

// =================================================
// Задача №2
// Чи буде помилка при виконанні наступної програми
// const userName = 20
// userName = "Іштван"

// Буде помилка, const не можна перезаписувати

// =================================================
// Задача №3
// Що потрапить в консоль?
// let numOne = 20
// let numTwo = "20"

// let numSumm = numOne + numTwo
// console.log(numSumm)

// До консолі потрапить рядок "2020", тому що,
// якщо хоча б один з операндів є рядок, то відбудеться конкатенація 