// Задача №1
// Що потрапить в консоль?

// let someVar = 0;
// ++someVar;

// if (someVar) {
// 	console.log(someVar);
// }

// Відповідь: в консоль потрапить число 1
// =================================================================
// Задача №2
// За допомогою циклу FOR виведіть в консоль 10 рядків:
// Пункт №1
// Пункт №2
// і т.д.

// Відповідь:
// for (let i = 0; i <= 10; i++) {
//   console.log(`Пункт №${i}`);
// }

// =================================================================
// Задача №3
// Що потрапить в консоль ?
// if (2 * 20 <= 10 || (30 / 2 < 5 && 10 <= "10") || 20 === "20") {
//   console.log("000");
// }

// Відповідь: в консоль нічого не потрапить, бо не виконується умова(false || (false && true) || false)

// =================================================================
// Задача №4
// Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
// Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
// Функція не має повертати NaN, Infinite або помилку

// function calcDivide(a, b) {
//   let res = a / b;
//   if (isFinite(res) && a > 0 && b > 0) {
//     console.log(`Результат ділення: ${res}`);
//     return res;
//   } else {
//     console.log(`Введіть два числа більше 0`);
//   }
// }

// calcDivide(15, 3);
// calcDivide(10);
// calcDivide(10, 3);
// calcDivide(10, 0);
// calcDivide(10, "divide");
// calcDivide();

// Задача №5
// Створіть масив даних - 5 елементів, один з яких число 10
// Обробіть масив за допомогою методу перебору
// Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль

// const arr = ["it", "array", "in", "js", 10];
// arr.forEach((item) => {
//   if (item === 10) {
//     console.log(item);
//   }
// });
